app/controllers/references_controller.rb

  def index
    @references = Reference.all
---
SELECT "references".* FROM "references"

  def create
    @reference = Reference.new(reference_params)

    respond_to do |format|
      if @reference.save
---
INSERT INTO "references" ("key", "entry_type", "author", "title", "journal", "year", "volume", "number", "pages", "month", "note", "publisher", "series", "address", "edition", "booktitle", "editor", "organization", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @reference.update(reference_params)
---
UPDATE "references" SET "entry_type" = ?, "updated_at" = ? WHERE "references"."id" = ?  [["entry_type", "article"], ["updated_at", "2017-04-01 10:19:54.955822"], ["id", 2]]

  def destroy
    @reference.destroy
---
DELETE FROM "references" WHERE "references"."id" = ?  [["id", 1]]

    def set_reference
      @reference = Reference.find(params[:id])
---
SELECT  "references".* FROM "references" WHERE "references"."id" = ? LIMIT 1  [["id", 1]]